'use client';

import React, { useState } from 'react';
import CustomList from '@/components/Common/CustomList';
import OptimizedImage from '@/components/ui/OptimizedImage';
const tabToHash = (tab: string) =>
  tab
    .toLowerCase()
    .replace(/[’']/g, '') // apostrophe remove
    .replace(/\s+/g, '-'); // spaces → dash

interface TabContent {
  text: string;
  imageName: string;
  bottomText: string;
  bottomTextList?: string[];
  secondlist?: string[];
  secondText?: string;
  extraList?: string[];
  extraText?: string;
  thirdText?: string;
  thirdList?: string[];
  fourText?: string;
  fiveText?: string;
  sixText?: string;
  fourList?: string[];
  fiveList?: string[];
  sixList?: string[];
  sevenText?: string;
  eightText?: string;
  nineText?: string;
  sevenList?: string[];
  eightList?: string[];
  nineList?: string[];
}

const FertilityTabs: React.FC = () => {
  const tabs = [
    'نصائح مفيدة للخصوبة',
    'أطعمة تزيد الخصوبة',
    'أسباب العقم عند الرجال',
    'أسباب العقم عند النساء',
    'الساعة البيولوجية للمرأة',
    'خلل التبويض',
    'بطانة الرحم',
    'أكياس المبيض',
    'الأورام الليفية الرحمية والعقم',
    'الإجهاض المتكرر',
    'فشل التلقيح الاصطناعي المتكرر',
  ];

  const tabContents: Record<string, TabContent> = {
    'نصائح مفيدة للخصوبة': {
      text: `
       لا ينبغي أن يكون مفاجئًا أن نمط الحياة الذي تعيشينه يؤثر بشكل مباشر على خصوبتك. بدءًا من اتخاذ خيارات نمط حياة صحي إلى استكمال تناولك للعناصر الغذائية المهمة، هناك العديد من الأشياء التي يمكنك القيام بها خارج العيادة لتحسين فرصك في الحمل والحفاظ عليها. سواء كنت في المراحل الأولى من تنظيم الأسرة أو تبحثين حاليًا عن مساعدة من عيادة الخصوبة، فإن التعديلات البسيطة على نمط الحياة والمكملات الغذائية اليومية الإضافية يمكن أن تعزز الخصوبة. هناك العديد من التغييرات المهمة التي يمكنك أنت وشريكك إجراؤها قبل وأثناء علاجات الخصوبة لزيادة فرصة نجاح الحمل.<br /><br />
      نوصي بإجراء هذه التعديلات على نمط الحياة إذا كنت تفكرين في الحمل.​
      `,
      imageName: 'fertility-helpful-tips',
      bottomText: `
        <strong>الكحول</strong><br /تجنب استخدام الكحول. ثبت أن الكحول يسبب تشوهات خلقية لدى الأجنة. بالإضافة إلى ذلك، فإن المرضى الذين يشربون الكحول لديهم انخفاض في معدلات الخصوبة، خاصة مع التلقيح الاصطناعي ومعدلات الإجهاض، وقد تبين أن معدلات الخصوبة تتضاعف مقارنة بأولئك الذين لا يشربون الكحول. وهذا أيضاً له تأثير مماثل على زوجك.<br /><br />
        <strong>التدخين</strong><br />التوقف عن التدخين والابتعاد عن أي شخص يدخن. التدخين متورط في العقم وانقطاع الطمث المبكر. يقلل التدخين من نجاح التلقيح الاصطناعي بنسبة 50% تقريبًا، كما أن للتدخين السلبي تأثيرات مماثلة. وهذا أيضاً له تأثير مماثل على زوجك.<br /><br />
        <strong>​
الأدوية والأدوية</strong> <br />التوقف عن العقاقير الترويحية والأدوية غير الضرورية. يرجى التوقف عن تناول جميع الأدوية غير الضرورية طبيًا قبل محاولة الحمل. إذا كنت تتناولين أدوية موصوفة من قبل طبيب آخر، فيرجى إخبارنا حتى نتمكن من تحديد ما إذا كانت الأدوية آمنة لتناولها أثناء محاولة الحمل وأثناء الحمل. وهذا ينطبق على شريكك أيضًا.<br /><br />
        <strong>النشاط البدني وفقدان الوزن</strong> <br />زيادة النشاط البدني وإنقاص الوزن إذا لزم الأمر. إذا كنتِ تعانين من زيادة الوزن، فمن الجيد أن تفقدي الوزن قبل محاولة الحمل. نحن نشجعك على ممارسة النشاط البدني والحصول على أفضل شكل ممكن لجسمك. في إحدى الدراسات، كانت لدى النساء البدينات اللاتي يمارسن الرياضة بانتظام فرصة أكبر ثلاث مرات للنجاح في التلقيح الاصطناعي. يجب على النساء اللاتي لا يعانين من السمنة المفرطة تجنب ممارسة التمارين الرياضية الشاقة. يبدو أن أي مستوى مفيد للنساء البدينات.<br /><br />
        <strong>ممارسة لتعزيز الخصوبة</strong> <br />إن نمط الحياة الصحي حيث تكون التمارين الرياضية روتينية يساعد في الحمل الناجح لدى كل من الرجال والنساء. اختر روتينًا رياضيًا معتدلًا ومتسقًا يمكنك الالتزام به. حيث أن ممارسة التمارين الرياضية الشاقة يمكن أن يكون لها تأثير سلبي على تحقيق حمل ناجح للأنثى. يُنصح بالأنشطة الهوائية المعتدلة. مارس التمارين الرياضية بما يكفي لرفع معدل ضربات القلب، مما يقلل من الإجهاد التأكسدي ويزيد من تدفق الدم دون إرهاق جسمك بالكامل.
      `,
      secondlist: [
        ' المشي: المشي السريع لمدة 30 دقيقة 5-6 مرات في الأسبوع يحرق السعرات الحرارية ويزيد من تدفق الدم دون إجهاد الجسم بشدة.',
        'اليوغا - على الرغم من أن هذا قد يبدو سهلاً، إلا أن الحفاظ على الوضعيات واستخدام مجموعات العضلات التي يتم التغاضي عنها غالبًا سوف يضخ قلبك ويسبب لك التعرق، وهو أمر مفيد.',
        ' السباحة – يعمل هذا التمرين الذي يشمل كامل الجسم على تقوية جذعك دون وضع الكثير من الضغط على مفاصلك. راقب وتيرتك. هدفك هو الحفاظ على إيقاع مريح لمدة 20 دقيقة على الأقل يجعلك تشعر بالنشاط، وليس اللهاث من أجل التنفس.',
        ' تمارين القلب الخفيفة الأخرى - تعتبر التمارين البيضاوية الخفيفة أو ركوب الدراجات السهلة أو الركض البطيء من الطرق الرائعة لتنشيط عضلة القلب. لكن حافظ على مقاومتك وسرعتك معتدلة؛ الوتيرة الجيدة هي عندما لا يزال بإمكانك إجراء محادثة كاملة أثناء التمرين.',
      ],
    },

    'أطعمة تزيد الخصوبة': {
      text: `
        تغيير نظامك الغذائي يمكن أن يزيد من خصوبتك ويمكن أن يؤثر بشكل إيجابي على فرصك في الحمل. هناك العديد من الأطعمة التي يمكنك إضافتها أو إزالتها من نظامك الغذائي والتي يمكن أن تؤثر على فرصك الإجمالية في الحمل.<br /><br />
        <strong>الأشياء التي يجب تناولها والأشياء التي يجب تجنبها</strong><br />
       ننصح بالتقليل من تناول اللحوم الحمراء، والتخلص من الدهون المتحولة (مثل الكعك والمعجنات وجميع الأطعمة المقلية)، والتأكد من أن 50% على الأقل من كل وجبة تتكون من الفواكه والخضروات. استخدمي زيت الزيتون في الخبز والتتبيلة والطبخ. فهو يحتوي على نسبة عالية من الدهون الأحادية غير المشبعة، والتي قد تكون مفيدة للنساء اللاتي يخضعن لعلاج التلقيح الاصطناعي، كما أنها مفيدة للصحة العامة. إن تقليل تناول السكر هو دائمًا فكرة جيدة. وينبغي تجنب الأطعمة المفرطة في الطهي.​<br />​<br />
       تحتوي العديد من الأطعمة اللذيذة على نسبة عالية من مضادات الأكسدة ويجب دمجها في نظامك الغذائي المعتاد. فيما يلي بعض الأطعمة الشائعة الأخرى التي تحتوي على نسبة عالية من مضادات الأكسدة بشكل طبيعي:
      `,
      imageName: 'fertility-foods-boost',
      bottomText: ``,
      secondlist: [
        'شجر العليق - أجهزة البلاك بيري',
        'توت',
        'فراولة',
        'الرمان',
        'التوت البري',
        'توت العليق',
        'الشوكولاتة الداكنة (قليلة السكر)',
        'الخرشوف (المطبوخ)',
        'البهارات (مثال: الزنجبيل، الأوريجانو، الكركم، الكمون)',
      ],
      secondText: `<strong>شاي أخضر </strong>
      <br />
     كما أن شرب الشاي الأخضر يوميًا يزيد أيضًا من تناول مضادات الأكسدة، لكننا لا ننصح بتناول كوب واحد من الشاي الأخضر منزوع الكافيين يوميًا لأن الكافيين قد يتداخل مع الخصوبة. يتم معالجة الشاي الأخضر بأقل قدر ممكن، مما يحافظ على خصائصه الصحية. على الرغم من أن عملية إزالة الكافيين تقلل من محتوى مضادات الأكسدة، إلا أن إضافة 50 ملغ من فيتامين C السائل إلى كل كوب من الشاي الأخضر منزوع الكافيين يمكن أن يزيد بشكل كبير من تناول مضادات الأكسدة.<br /><br />
      <strong>مادة الكافيين </strong>
      <br />
     الاستهلاك المفرط للمنتجات التي تحتوي على الكافيين من قبل الأنثى، مثل القهوة والشاي والكولا والشوكولاتة قد يقلل من الخصوبة، على الرغم من تضارب الدراسات. لتوخي الحذر، يجب الحد من تناوله إلى الحد الأدنى. وينصح بتناول كوب واحد كحد أقصى في اليوم. الكافيين ليس ضارًا بخصوبة الشريك الذكر <br /> <br />
      <strong>المكملات </strong>
      <br />
    المكملات الغذائية الأخرى لها خصائص مضادة للأكسدة وتزيد من تدفق الدم، مما يساعد على تعزيز الظروف الصحية للبيض والأجنة.
      `,
      extraList: [
        'تعتبر أقراص فيتامين ما قبل الولادة فكرة جيدة لاستخدامها قبل بضعة أشهر من التفكير في علاج العقم.',
        'قد تعمل أوميغا 3 على تحسين النجاح في زرع الأجنة، وتقليل الولادة المبكرة ولها آثار إيجابية على نمو دماغ الجنين.',
        'يوجد حمض الفوليك بشكل طبيعي في الخضروات الورقية الداكنة (مثل السبانخ والقرنبيط والأفوكادو والحبوب المدعمة). تحتوي فيتامينات ما قبل الولادة عادةً على 400-800 ميكروغرام من حمض الفوليك يوميًا لتقليل خطر الإصابة بمجموعة صغيرة ولكنها مهمة جدًا من تشوهات الجنين (الجمجمة والعمود الفقري والقلب).',
      ],
    },

    'أسباب العقم عند الرجال': {
      text: `
       كما هو الحال عند النساء في العقم، تساهم عوامل العقم عند الرجال في حوالي 40% من جميع حالات العقم. هناك أربعة أسباب رئيسية للعقم عند الرجال:


      `,
      imageName: 'fertility-male-infertility',
      bottomText: ``,
      secondlist: [
        'اضطرابات تحت المهاد/الغدة النخامية (1-5%)',
        'اضطرابات الغدد التناسلية (35%)',
        ' اضطراب نقل الحيوانات المنوية (15%)',
        ' أسباب غير معروفة (45%)',
      ],
      secondText: `
       عادة ما يحدث العقم عند الرجال بسبب مشاكل في إنتاج الحيوانات المنوية أو نقل الحيوانات المنوية. تشمل تشوهات الحيوانات المنوية؛ عدد منخفض، حركة منخفضة، شكل غير طبيعي مرتفع أو بريد عشوائي قصير العمر.<br />
       قد يكون سبب تشوهات الحيوانات المنوية واحد أو أكثر من الأسباب التالية:
      `,
      extraList: [
        'التهاب الخصيتين',
        ' تورم الأوردة في كيس الصفن (دوالي الخصية)',
        'الخصيتين المتخلفة',
      ],
      thirdText: `
        تشمل أسباب انخفاض عدد الحيوانات المنوية أو قلة الحيوانات المنوية واحدًا أو أكثر مما يلي:
      `,
      thirdList: [
        ' حالة وراثية موجودة مسبقًا',
        ' تعاطي الكحول أو التبغ أو المخدرات الأخرى',
        'عدوى النكاف الشديدة بعد البلوغ',
        'إصلاحات الفتق',
        'الاضطرابات الهرمونية',
        'التعرض للمواد الكيميائية السامة',
        'التعرض للإشعاع',
        'الانسداد الناجم عن عدوى سابقة',
        'ارتداء ملابس داخلية مقيدة أو ضيقة',
        ' إصابة في منطقة الفخذ',
      ],
      fourText: `
     يمكن أن يحدث العقم عند الرجال أيضًا عندما تكون هناك مشاكل في القذف. قد تشمل مشاكل القذف أيًا مما يلي:
      `,
      fourList: [
        ' سرعة القذف',
        'القذف الرجوعي، والذي يحدث عندما يضطر السائل المنوي إلى العودة إلى المثانة',
        'اختلالات الانتصاب',
        'مضاعفات العلاج الإشعاعي أو الجراحة',
      ],
      fiveText: `
    يمكن أن تشمل الأسباب الأخرى لعقم الرجال ما يلي:
      `,
      fiveList: [
        'تاريخ الأمراض المنقولة جنسيا',
        'التهابات المسالك البولية',
        'استخدام أنواع معينة من الأدوية',
      ],
      sixText: `
     تقييم احتمالية العقم:<br /><br />
     سيتم تقييم العقم المحتمل عند الذكور كجزء من تقييم شامل. سيتضمن التقييم مراجعة التاريخ الطبي فيما يتعلق بالعوامل المساهمة المحتملة. قد يستخدم طبيبك (أخصائي أمراض الذكورة) واحدًا أو أكثر من الاختبارات التالية لتقييم الخصوبة:
      `,
      sixList: [
        ' تحليل السائل المنوي لتحديد عدد ونوعية الحيوانات المنوية',
        'فحص الدم للتحقق من وجود التهابات أو مشاكل هرمونية. مستويات الهرمونات لا تقل أهمية في خصوبة الرجال كما هي في خصوبة الإنا',
        ' عمل مزرعة للسوائل من القضيب للتحقق من وجود التهابات',
        'الفحص البدني للقضيب وكيس الصفن والبروستاتا',
      ],
      sevenText: `
      عندما يتم تحليل السائل المنوي، سيبحث مقدم الرعاية الصحية الخاص بك عن بعض العلامات المحددة للوصول إلى الخصوبة.
      `,
      sevenList: [
        ' إجمالي كمية أو حجم السائل المنوي - 2 ملليلتر يعتبر طبيعيا. قد تشير الكمية الأقل إلى وجود مشكلة في الحويصلات المنوية أو القنوات المسدودة أو مشكلة في غدة البروستاتا.',
        ' عدد الحيوانات المنوية – 15 مليون أو أكثر لكل مليلتر يعتبر المعدل الطبيعي لعدد الحيوانات المنوية. أقل من 10 ملايين يعتبر',
        'مورفولوجيا – يؤثر حجم وشكل الحيوانات المنوية على قدرة الحيوانات المنوية على الوصول إلى البويضة وتخصيبها. ما لا يقل عن 4% من الحيوانات المنوية ذات الشكل الطبيعي في العينة تعتبر طبيعية.',
        ' الحركة – حركة وعدد الحيوانات المنوية النشطة. يجب أن تتمتع 32% على الأقل من الحيوانات المنوية بحركة نشطة إلى الأمام حتى تعتبر طبيعية.​',
      ],
      eightText: `
      كيف يتم علاج العقم عند الرجال؟<br /><br />
      يتم علاج العقم عند الرجال في أغلب الأحيان بالطرق التقليدية التي تشمل واحدًا أو أكثر مما يلي:
      `,
      eightList: [
        'تناول الأدوية التي تساعد على زيادة إنتاج الحيوانات المنوية',
        'تناول المضادات الحيوية لعلاج العدوى',
        'تناول الهرمونات لتحسين التوازن الهرموني',
        'تجنب الاستحمام بالماء الساخن لفترة طويلة، واستخدام أحواض الاستحمام الساخنة أو الساونا',
        'ارتداء ملابس داخلية فضفاضة مثل شورتات الملاكم مقابل شورتات الفارس',
      ],
      nineText: `
      
قد يتحسن إنتاج الحيوانات المنوية أيضًا عن طريق تناول المكملات الغذائية المثبتة سريريًا. أي شيء يزيد من عدد الحيوانات المنوية السليمة يزيد من فرص الحمل.<br /><br />
     
يعد التلقيح داخل الرحم خيارًا إذا كان عدد الحيوانات المنوية لدى الرجل أو حركتها منخفضًا قليلاً. في هذا الإجراء، يتم جمع الحيوانات المنوية من خلال القذف المتعدد. ثم بعد غسلها وتركيزها توضع العينات في رحم الأنثى.<br /><br />
     ​

يعد التخصيب في المختبر خيارًا آخر وأفضل يمكن استخدامه للتغلب على عوامل العقم عند الذكور. في هذا الإجراء، يتم تخصيب الحيوانات المنوية والبويضة في المختبر وبعد ذلك يتم وضع البويضة المخصبة (الجنين المتكون) في رحم الأنثى.<br /><br />
     ​

لا يوجد عادة ما يمكن فعله لمنع العقم عند الذكور الناجم عن مشاكل وراثية أو مرض. ومع ذلك، هناك إجراءات يمكن للرجال اتخاذها لتقليل احتمالية العقم. وتشمل هذه:
      `,
      nineList: [
        ' تجنب الأمراض المنقولة جنسيا',
        'تجنب المخدرات غير المشروعة',
        'تجنب الإشعاع عندما يكون ذلك ممكنا',
        ' تجنب التعرض للمواد الكيميائية السامة',
        'تجنب استخدام الكحول',
        ' مراعاة النظافة الشخصية والممارسات الصحية الجيدة',
        'تجنب الحمامات الساخنة الطويلة أو أحواض الاستحمام الساخنة أو الساونا',
        'ارتداء ملابس داخلية فضفاضة',
      ],
    },
    'أسباب العقم عند النساء': {
      text: `
      يمكن لمجموعة متنوعة من العوامل أن تؤثر على الخصوبة لدى النساء والرجال. بشكل عام، يوصى بأن تقوم المرأة التي يقل عمرها عن 35 عامًا والتي تحاول الحمل لمدة عام، أو المرأة التي يزيد عمرها عن 35 عامًا والتي تحاول الحمل لمدة ستة أشهر، باستشارة أخصائي الخصوبة لتحديد أفضل مسار للعمل. يجب على النساء اللاتي تعرضن لأكثر من ثلاث حالات إجهاض متكررة أن يطلبن أيضًا رعاية أخصائي. تتمتع العديد من النساء اللاتي تعرضن للإجهاض بحمل صحي، لكن ذلك قد يشير إلى وجود مشكلة في الخصوبة. ضعي في اعتبارك أن مشاكل العقم شائعة، حيث يعاني واحد من كل ثمانية أزواج من مشكلة في الحمل.<br /><br />
     العقم عند النساء أمر شائع جدًا، وهو أمر ليس مفاجئًا نظرًا للمجموعة المعقدة من الأحداث الطبيعية التي يجب<br />
     أن تحدث من أجل الولادة. تساهم عوامل العقم عند النساء في حوالي 40% من جميع حالات العقم. عادة، يجب على جسد المرأة:

​
      `,
      imageName: 'fertility-female-infertility',
      bottomText: ``,
      secondlist: [
        'لديك احتياطي جيد من البيض الصحي',
        'إنضاج البويضات بشكل صحيح داخل المبيضين في الوقت والسرعة المناسبين',
        'أن تكون قناتا فالوب صافيتين بحيث يمكن لكل من البويضة والحيوانات المنوية الدخول والالتقاء',
        'تكوين بطانة طبيعية في الرحم في الوقت المناسب لاستقبال الجنين',
        'السماح بالزرع السليم للجنين',
        'تغذية الجنين بشكل كامل طوال فترة نموه خلال فترة الحمل',
        ' احملها طوال المدة',
      ],
      secondText: `
      إنها عملية معقدة لا تسير دائمًا كما هو مخطط لها. ومع ذلك، يمكن لأطبائنا، إلى جانب التكنولوجيا المتطورة والتقنيات الطبية المتقدمة، المساعدة في حل عدد كبير من مشكلات الخصوبة. <br /><br />
        ​

تشمل الأسباب الأكثر شيوعًا للعقم عند النساء مشاكل الإباضة، أو تلف قناة فالوب أو الرحم، أو مشاكل في عنق الرحم. يمكن أن يساهم العمر في الإصابة بالعقم، لأنه مع تقدم المرأة في العمر، تميل خصوبتها إلى الانخفاض بشكل طبيعي.<br /><br />
      قد تكون مشاكل التبويض ناجمة عن واحد أو أكثر من الأسباب التالية:
      `,
      extraList: [
        'خلل في الهرمونات',
        'وجود ورم أو كيس في المبيضين',
        'اضطرابات الأكل مثل فقدان الشهية أو الشره المرضي',
        'تعاطي الكحول أو المخدرات',
        'مشاكل الغدة الدرقية',
        'الوزن الزائد',
        ' ضغط',
        'ممارسة التمارين الرياضية المكثفة التي تسبب خسارة كبيرة في الدهون في الجسم أقل من المعدل الطبيعي',
        'دورات الحيض قصيرة للغاية',
      ],
      thirdText: `
      يمكن أن يحدث تلف قناتي فالوب أو الرحم بسبب واحد أو أكثر من الأسباب التالية:
      `,
      thirdList: [
        'مرض التهاب الحوض',
        'عدوى سابقة',
        'الاورام الحميدة في الرحم',
        ' بطانة الرحم أو الأورام الليفية',
        'الأنسجة الندبية أو الالتصاقات',
        'الأمراض الطبية المزمنة',
        'الحمل خارج الرحم (البوقي) السابق',
        ' التشوهات الخلقية في الجهاز التناسلي',
      ],
    },
    'الساعة البيولوجية للمرأة': {
      text: `
     نحن نؤمن بأن كل امرأة تحتاج إلى الحقائق المتعلقة بساعتها البيولوجية. ابدأ هنا لمعرفة المزيد عن سن الخصوبة وكيف يؤثر الوقت حقًا على قدرتك على إنجاب طفل سليم.

<br /><br />
     ليست كل بيضة تؤدي إلى طفل، مهما كان عمرك صغيرا. من المفاهيم الخاطئة الشائعة أن لدينا فرصة بنسبة 100٪ للحمل في كل مرة نقوم فيها بالإباضة (أي كل شهر). ولأن نسبة معينة من بويضاتنا تكون غير طبيعية في أي عمر، ولأن الإخصاب يجب أن يحدث في فترة زمنية ضيقة بعد حدوث الإباضة، فحتى المرأة الشابة السليمة التي تحاول الحمل لديها فرصة بنسبة 20% فقط كل شهر.<br /><br />
     ​

تنخفض الخصوبة بشكل حاد عند سن 35 عامًا - أي أكثر من 10 سنوات قبل الوصول إلى سن اليأس. كنساء، تبدأ
      `,
      imageName: 'fertility-biologic-clock',
      bottomText: ``,

      secondText: `
        حياتنا الإنجابية عندما تأتي الدورة الشهرية الأولى، عادةً في سن 12 عامًا تقريبًا (البلوغ)، وتستمر حتى آخر دورة شهرية لنا، عادةً في سن 52 تقريبًا (انقطاع الطمث). ولكن نظرًا لانخفاض عدد البويضات (احتياطي المبيض) وجودة البويضات مع تقدمنا ​​في العمر، فإننا لا نبقى خصبين طوال هذه الفترة الزمنية.<br /><br />
       ​

لدى النساء تحت سن 35 عامًا فرصة بنسبة 20٪ تقريبًا للحمل بشكل طبيعي في كل دورة. بحلول سن الأربعين، تكون فرصة الحمل بشكل طبيعي كل شهر 5٪ فقط. بعد ذلك، يتراجع الحمل الطبيعي بشكل أسرع.<br /><br />
       في الواقع، تظهر إحصائيات البحث العلمي للنساء اللاتي يخضعن للتخصيب خارج الرحم (IVF) أن معدل الحمل ينخفض ​​أيضًا مع تقدم العمر. قد تتراوح نسبة الحمل بالتلقيح الاصطناعي لدى النساء تحت سن 35 عامًا من 40-50% وتنخفض إلى 30% عند سن الأربعين وتنخفض أكثر بعد سن 43 إلى أقل من 5%.<br /><br />
       مع تقدمك في العمر، يبدأ الحمض النووي داخل بيضك في التدهور. نظرًا لأن بيضك موجود معك منذ ما قبل ولادتك، فإنه يتعرض لجميع أنواع التأثيرات الضارة، ولكن في الغالب لا يمكن تجنبها، طوال حياتنا: الحمى، والالتهابات، والإجهاد، والسموم، والجذور الحرة. ولأن البويضات هشة وسهلة التلف، فإن هذا التعرض يمكن أن يؤدي إلى تشوهات صبغية مما يؤثر على قدرتها على إنتاج أجنة طبيعية جاهزة للزرع وحدوث الحمل.<br /><br />
       لا يوجد اختبار لجودة البيض. الطريقة الوحيدة لمعرفة ما إذا كانت البويضة طبيعية كروموسوميًا هي محاولة تخصيبها خارج الجسم، وإذا نجح الإخصاب، يتم إجراء اختبار جيني على الجنين. ولكن نظرًا لأن الضرر الذي يلحق بحمضنا النووي يحدث بشكل طبيعي وحتمي مع مرور الوقت، فإن عمرك يمكن أن يعطي صورة دقيقة إلى حد ما عن النسبة الطبيعية لبويضاتك.<br /><br />
        هذه حقيقة<br /><br />
       ​نظرًا لأن العمر يرتبط بشكل مباشر بجودة البويضة، وبالتالي قدرة البويضة على الإخصاب في حمل صحي، فإن عمر البويضة هو الأكثر أهمية عندما يتعلق الأمر بالخصوبة. إن طلب المساعدة لعلاج الخصوبة في سن أصغر يجعل الأمر أكثر أهمية. إذا كنت مستعدة للتحرك بشكل استباقي بشأن مستقبل خصوبتك، يمكنك تحديد موعد لتقييم الخصوبة اليوم في مركز بنون الطبي لمقابلة أحد خبراء الخصوبة لدينا.
      `,
    },
    'خلل التبويض': {
      text: `
      الإباضة هي إطلاق البويضة من المبيض. ويجب أن يحدث هذا من أجل تحقيق الحمل بشكل طبيعي. إذا كانت الإباضة غير منتظمة، ولكنها ليست غائبة تمامًا، فإن هذا يسمى قلة الإباضة. يسمى الغياب الكامل للإباضة بالإباضة. يعد خلل التبويض سببًا شائعًا للعقم عند النساء، ويحدث لدى ما يصل إلى 40 بالمائة من النساء المصابات بالعقم.<br /><br />
      ​

​عادة، تعاني النساء المصابات بخلل في التبويض من فترات غير منتظمة. وفي أسوأ الحالات، قد لا يحصلن على دوراتهن على الإطلاق. إذا كانت دورتك الشهرية أقل من 21 يومًا، أو أطول من 36 يومًا، فقد يكون لديك خلل في التبويض. إذا كانت دورتك الشهرية تقع ضمن النطاق الطبيعي من 21 إلى 36 يومًا، ولكن طول تدفق الدم في دورتك يختلف بشكل كبير من شهر لآخر، فقد يكون ذلك أيضًا علامة على خلل في التبويض.
      `,
      imageName: 'fertility-ovulatory-dysfunction',
      bottomText: ``,
    },
    'بطانة الرحم': {
      text: `
     يحدث التهاب بطانة الرحم عندما يتم العثور على أنسجة بطانة الرحم، التي تبطن الرحم عادة، في مكان آخر من الجسم. تشمل المواقع الأكثر شيوعًا لمرض بطانة الرحم المبيضين وقناتي فالوب وتجويف الحوض. يبدأ هذا النسيج في العمل تمامًا مثل أنسجة الرحم الطبيعية. أثناء الحيض، تبدأ الأنسجة بالنزيف. وعندما يحدث هذا، يبدأ النسيج الندبي بالتشكل، عادة في منطقة الحوض. يمكن أن يؤدي النسيج الندبي وبطانة الرحم إلى مشاكل محتملة ويسبب العقم.<br /><br />بطانة الرحم​<br /><br />
     بطانة الرحم هي حالة شائعة وترتبط بزيادة فرصة حدوث مشكلة في الحمل. قد تشمل العلامات والأعراض الشائعة لمرض بطانة الرحم الهاجرة ما يلي:
      `,
      imageName: 'fertility-endometriosis',
      bottomText: ``,
      secondlist: [
        'فترات مؤلمة. قد تبدأ آلام وتشنجات الحوض قبل الدورة الشهرية وتمتد لعدة أيام خلال الدورة الشهرية. قد تشعر أيضًا بألم في أسفل الظهر والبطن.',
        'ألم عميق في المهبل مع الجماع العميق.',
        'ألم مع حركات الأمعاء أو التبول.',
        ' النزيف الزائد أثناء الدورة الشهرية.',
        ' العقم. قد يتم تشخيص التهاب بطانة الرحم لأول مرة لدى بعض النساء اللاتي يبحثن عن علاج للعقم.',
        'أعراض أخرى. قد تشعرين أيضًا بالتعب أو الإسهال أو الإمساك أو الانتفاخ أو الغثيان، خاصة أثناء فترات الحيض.',
        ' بعض النساء المصابات بالانتباذ البطاني الرحمي لا يعانين من مثل هذه الأعراض.',
      ],
      secondText: `
       هناك حالات أخرى قد يكون لها أعراض مشابهة ولكنها ليست بطانة الرحم. هناك حالات أخرى قد يكون لها أعراض مشابهة ولكنها ليست بطانة الرحم. غالبًا ما يتم الخلط بين التهاب بطانة الرحم وحالات مثل مرض التهاب الحوض وكيسات المبيض ومتلازمة القولون العصبي.<br /><br />
        عادةً ما تؤثر أعراض التهاب بطانة الرحم على النساء اللاتي لم ينجبن أبدًا. المرض له ارتباط وراثي قوي. إذا كان أحد أقاربك يعاني من التهاب بطانة الرحم، فأنت أكثر عرضة للإصابة بالتهاب بطانة الرحم أيضًا بستة أضعاف. تشمل العوامل الأخرى لحدوث التهاب بطانة الرحم ما يلي:
      `,
      extraList: [
        'دورات الحيض التي تحدث في أقل من 28 يومًا',
        ' استمرار نزيف الحيض لأكثر من 5 أيام',
        'خلل خلقي في الرحم',
        'ضيق فتحة عنق الرحم بشكل غير طبيعي',
      ],
      thirdText: `
       تشخيص التهاب بطانة الرحم<br /><br />
       عادة ما يتم تشخيص التهاب بطانة الرحم من خلال أخذ التاريخ الدقيق فيما يتعلق بالدورة الشهرية من قبل طبيبك والتصوير التشخيصي مثل الموجات فوق الصوتية. ومع ذلك، يعتبر تنظير البطن أفضل أداة تشخيصية لتأكيد التشخيص ولكنه ليس ضروريًا دائمًا لكل امرأة. المضاعفات الرئيسية لبطانة الرحم هي ضعف الخصوبة. قد يؤدي التهاب بطانة الرحم إلى انسداد الأنبوب ويمنع التقاء البويضة والحيوانات المنوية. لكن الحالة تؤثر أيضًا على الخصوبة بشكل غير مباشر مثل إتلاف الحيوانات المنوية أو البويضة. تتأثر بطانة الرحم أيضًا بشكل غير مباشر بانتباذ بطانة الرحم عن طريق التدخل في عملية زرع الأجنة.<br /><br />
       موضوعات هامة

<br /><br />
     ​على الرغم من أن العديد من النساء المصابات بانتباذ بطانة الرحم الخفيف إلى المتوسط ​​لا يزال بإمكانهن الحمل والاستمرار في الحمل حتى نهايته، إلا أن أطباء الخصوبة ينصحون النساء المصابات بانتباذ بطانة الرحم بعدم تأخير الإنجاب لأن الحالة قد تتفاقم مع مرور الوقت. إحدى القضايا المهمة بالنسبة للنساء المعروف إصابتهن بانتباذ بطانة الرحم وصعوبة الحمل هي استشارة خبير الخصوبة في أقرب وقت ممكن لمناقشة خطة الإدارة وخيارات العلاج لأن احتياطي المبيض لديها قد يتفاقم بشكل أسرع من المعتاد مقارنة بالنساء الأخريات اللاتي لا يعانين من بطانة الرحم.
      `,
    },
    'أكياس المبيض': {
      text: `
    كيس المبيض هو كيس مملوء بالسوائل يتطور على مبيض المرأة. إنها شائعة جدًا ولا تسبب عادةً أي أعراض. قد تؤثر أكياس المبيض على كلا المبيضين في نفس الوقت، أو قد تؤثر على واحد فقط. تحدث معظم أكياس المبيض بشكل طبيعي وتختفي خلال بضعة أشهر دون الحاجة إلى أي علاج. تتطور معظم أكياس المبيض نتيجة لدورتك الشهرية (الكيسات الوظيفية) وتعتبر ظاهرة طبيعية. الأنواع الأخرى من الخراجات أقل شيوعًا.<br /><br />
    عادةً ما تكون الأكياس الوظيفية غير ضارة، ونادرًا ما تسبب الألم، وغالبًا ما تختفي من تلقاء نفسها خلال دورتين أو ثلاث دورات شهرية. هناك نوعان من الأكياس الوظيفية:​
      `,
      imageName: 'fertility-ovarian-cysts',
      bottomText: ``,
      secondlist: [
        'الكيس الجريبي الذي يبدأ عندما لا يتمزق الجريب ويطلق البويضة.',
        'كيس الجسم الأصفر الذي يتشكل بعد تمزق البويضة وإطلاقها، وبالتالي يتراكم السائل داخل الجريب، مما يؤدي إلى نمو الجسم الأصفر إلى كيس.',
      ],
      secondText: `
      تشمل الأنواع الأخرى من الأكياس ما يلي:
      `,
      extraList: [
        'الأكياس النزفية هي أكياس مملوءة بالدم تحدث عندما يتمزق جدار الكيس. هذا التمزق يمكن أن يسبب نزيفًا في الكيس مما يؤدي إلى كيس نزفي. وهذه أيضًا ظاهرة طبيعية وغالبًا ما تختفي من تلقاء نفسها.',
        'الأكياس الجلدية التي تحتوي على أنسجة مثل الشعر أو الجلد أو الأسنان، لأنها تتكون من الخلايا الجنينية. ونادرا ما تكون سرطانية.',
        'الأورام الغدية الكيسية التي تتطور على المبيض وقد تكون مملوءة بمادة مائية أو مخاطية.',
        ' أورام بطانة الرحم التي تتطور نتيجة التهاب بطانة الرحم.',
      ],
      thirdText: `
     الغالبية العظمى من أكياس المبيض غير سرطانية (حميدة) وعدد قليل منها سرطاني. تعد الأكياس السرطانية أكثر شيوعًا عند النساء اللاتي مررن بمرحلة انقطاع الطمث.<br /><br />
      تشمل المضاعفات المرتبطة بكيسات المبيض ما يلي:

​
      `,
      thirdList: [
        ' التواء المبيض الذي يحدث نتيجة لتضخم الكيس ويسبب بداية مفاجئة لألم شديد في الحوض والغثيان والقيء. يمكن أن يؤدي التواء المبيض إلى انقطاع تدفق الدم إلى المبيض ويؤثر على وظيفته.',
        'تمزق الكيس الذي يسبب ألمًا شديدًا ونزيفًا داخليًا.',
      ],
      fourText: `
     <strong>علاج أكياس المبيض</strong>
    
      `,
      fourList: [
        ' يمكن علاج أكياس المبيض عن طريق تناول الأدوية أو عن طريق إجراء عملية جراحية. يعتمد العلاج الطبي أو الجراحي على نوع الكيس ومدى تأثيره على صحة المرأة.',
        ' إذا كان لديك كيس وظيفي، فقد يصف لك طبيبك حبوب منع الحمل للمساعدة في تصغير حجمه أو اختفائه. إذا كنت تصابين بكيسات المبيض في كثير من الأحيان، فإن حبوب منع الحمل تقلل من فرصة تكوين أكياس جديدة.',
        ' في حالة الاشتباه في التواء كيس المبيض، فقد يحتاج طبيبك إلى إجراء عملية جراحية على المبيض لاستعادة الكيس وإزالته.',
        ' تذكر أن كل نوع من الكيس يتم علاجه بشكل مختلف. التشخيص الدقيق يؤدي إلى العلاج المناسب.',
      ],
    },
    'الأورام الليفية الرحمية والعقم': {
      text: `
    يتكون الرحم من طبقة سميكة تسمى "عضل الرحم" تحيط ببطانة رقيقة تسمى "بطانة الرحم" والتي يزرع فيها الجنين وتعمل على حماية وتغذية الحمل المتنامي. وهي بطانة الرحم التي تتساقط كل شهر أثناء الدورة الشهرية.<br /><br />
    إنها حالة شائعة جدًا، وحوالي 50٪ من جميع النساء في سن الإنجاب يتطور لديهن نمو حميد في عضل الرحم، يسمى أورام ليفية. ونادرا ما تكون هذه الأورام خبيثة. يمكن أن تكون موجودة في جدار الرحم، على السطح الخارجي للرحم أو داخل تجويف الرحم.<br /><br />
     تبدأ معظم الأورام الليفية كآفات صغيرة جدًا ويمكن أن تنمو إلى حجم كبير.<br />
     أعراض
      `,
      imageName: 'fertility-uterine-fibroids',
      bottomText: ``,

      secondText: `
       يمكن أن تحدث الأورام الليفية، حتى الكبيرة منها، دون ظهور أي أعراض على الإطلاق. ومع ذلك، فإنها يمكن أن تسبب أيضًا مجموعة متنوعة من الأعراض اعتمادًا على حجمها وموقعها. الأعراض الأكثر شيوعًا هي نزيف الحيض الغزير المصحوب بألم الدورة الشهرية إذا كان الورم الليفي يبرز في تجويف الرحم. بعض الأورام الليفية تكون كبيرة وتسبب أعراض الضغط على الأعضاء المجاورة مثل المثانة أو القولون، والألم مع الإيلاج العميق أثناء الجماع، وتهيج المثانة، والضغط على المستقيم، والإمساك، وحركات الأمعاء المؤلمة.<br /><br />
       تأثير الأورام الليفية الرحمية على الخصوبة<br /><br />
       معظم الأورام الليفية الرحمية لا تؤثر على الخصوبة، فقط تلك الأورام الليفية التي تبرز في تجويف الرحم هي التي تؤثر على الخصوبة. تشمل الاستثناءات الأورام الليفية الكبيرة داخل الرحم التي تسد فتحات قناة فالوب في الرحم.<br /><br />
       التشخيص<br /><br />
      يمكن إجراء التشخيص بسهولة عن طريق الفحص بالموجات فوق الصوتية للحوض. ومع ذلك، في بعض الأحيان يكون من الصعب معرفة ما إذا كان الورم الليفي يؤثر على تجويف الرحم. لذلك، تحتاج العديد من النساء اللاتي يبحثن عن علاج للخصوبة إلى التأكد من أن تجويف الرحم سليم إذا كان الفحص بالموجات فوق الصوتية غير حاسم. للتأكد من أن تجويف الرحم سليم، يوصى بإجراء بسيط يسمى تنظير الرحم.<br /><br />
      ​

تنصح معظم النساء بإزالة الورم الليفي المصاب جراحياً. ومع ذلك، هناك علاجات غير جراحية أخرى إما غير فعالة أو أكثر ضررًا نسبيًا من الجراحة.<br /><br />
إذا كنت تعاني من العقم والأورام الليفية، فإن خبراء الخصوبة هم أفضل الأطباء الذين يمكنك استشارتهم. غالبًا ما يناقشون الخيارات المستنيرة وأي التدخل الجراحي يعمل بشكل أفضل لحالتك.
      `,
    },
    'الإجهاض المتكرر': {
      text: `
     يتم تعريف الإجهاض المتكرر على أنه فقدان ثلاث حالات حمل متتالية أو أكثر في الأشهر القليلة الأولى من الحمل. بشكل عام، يبلغ خطر الإجهاض في أي حمل حوالي 15-20٪. بعد ثلاث حالات إجهاض متتالية، يصل خطر حدوث إجهاض آخر إلى حوالي 40٪. علاوة على ذلك، قد تصاب النساء بالإجهاض المتكرر بعد الحمل الناجح.<br /><br />
    ​

غالبًا ما يترك الإجهاض المتكرر المرضى يشعرون بالإحباط والإحباط بشأن مواقفهم وأكثر إرهاقًا إذا اقترن بالعقم. قد يكون لكل من العقم والإجهاض المتكرر عوامل مسببة متداخلة.<br /><br />
     قد تشمل أسباب حالات الإجهاض المتكررة ما يلي:
      `,
      imageName: 'fertility-recurrent-miscarriage',
      bottomText: ``,
      secondlist: [
        'عمر الأم المتقدم',
        ' خلل في الكروموسومات',
        'متلازمة الفوسفوليبيد',
        'التشوهات الخلقية في الرحم',
        'الأنسجة الندبية داخل الرحم',
        'الأورام الليفية المتعددة داخل الجدار وتحت المخاطية',
        'عدم كفاءة عنق الرحم',
        'متلازمة المبيض المتعدد الكيسات',
        'داء السكري غير المنضبط',
        'مرض الغدة الدرقية',
        'العوامل المناعية',
        ' أهبة التخثر الموروثة',
        'الالتهابات​​',
      ],
      secondText: `
      قد يحدد التاريخ الدقيق والاستقصاءات ذات الصلة العوامل التي تساهم في الإجهاض المتكرر وتساعد في خطة علاج الحمل المستقبلي. يُقترح العلاج وفقًا للسبب أو السبب المحتمل للإجهاض المتكرر.<br /><br />
      ​

إن فقدان الحمل قد يجعلك تشعرين بالقلق، وتتساءلين عما إذا كنت ستتمكنين من الحمل مرة أخرى أو إنجاب طفل سليم. ربما تسأل نفسك إذا كنت قد فعلت شيئًا خاطئًا أو كان بإمكانك منع ذلك بطريقة أو بأخرى. في 50% من حالات الإجهاض، لا يتم تحديد السبب أبدًا. ولكن على الجانب المشرق، فإن معظم النساء اللاتي يعانين من حالة إجهاض واحدة أو أكثر ينجبن في النهاية أطفالًا أصحاء.
      `,
    },
    'فشل التلقيح الاصطناعي المتكرر': {
      text: `
    يتم تعريف فشل التلقيح الاصطناعي المتكرر عندما تخضع المريضة لدورات متعددة من نقل الأجنة دون أن يؤدي ذلك إلى الحمل. هذه هي واحدة من أكثر الظروف المحبطة والمجهدة لكل من المريض والطبيب.<br /><br />
    هناك عدة أسباب قد تفسر فشل عملية الزرع. يمكن أن يكون بسبب الجنين أو بطانة الرحم أو كليهما. قد تكون هناك عوامل مشتركة أخرى. ومع ذلك، في كثير من الحالات لا نستطيع تفسير سبب فشل التلقيح الاصطناعي المتكرر.<br /><br />
   الأسباب الأكثر شهرة لفشل التلقيح الاصطناعي هي:
      `,
      imageName: 'fertility-recurrent-ivf-failure',
      bottomText: ``,
      secondlist: [
        'عمر الأم المتقدم',
        ' تطور بطيء للأجنة في مختبر التلقيح الاصطناعي',
        'قشرة سميكة على الجنين وصعوبة في الفقس',
        ' تشوهات داخل الرحم مثل؛ ورم أو ورم ليفي أو تندب أو التهاب.',
        ' تجمع السوائل داخل قناة فالوب',
        ' تجمع السوائل داخل تجويف الرحم',
        'تقنية نقل الأجنة الصعبة',
        'العوامل المناعية',
        ' تشوهات الكروموسومات في الأجنة',
        ' أمراض الأم الطبية',
        'تحفيز المبيض دون المستوى الأمثل أثناء دورة التلقيح الصناعي',
        'سوء نوعية الحيوانات المنوية​',
      ],
      secondText: `
      الامتحانات<br />
      تعد إدارة فشل التلقيح الاصطناعي المتكرر عملية صعبة ولها تأثير مالي على الأزواج. هناك حاجة إلى العديد من التحقيقات في هذا النوع من النساء لتحديد الأسباب أو العوامل المحتملة التي يمكن علاجها.<br /><br />تشمل التحقيقات الشائعة ما يلي:
      `,
      thirdList: [
        'وظيفة الغدة الدرقية',
        'شاشة التخثر',
        'الاختبارات المناعية',
        'تنظير الرحم',
        'اختبار الكروموسومات',
        'شاشة مرض السكري',
        'مصفوفة تقبل بطانة الرحم (ERA)',
      ],
      fourText: `
      عادة، يتم توجيه الإدارة نحو السبب إذا تم التعرف عليه. ومع ذلك، فإن بدء العلاج يحسن النتيجة ولكن هذا لا يعني دائمًا حدوث الحمل. في العديد من الظروف، لا يتم تحديد سبب (فشل التلقيح الصناعي المتكرر غير المبرر) ولكن طبيبك قد يحاول العلاج التجريبي على أمل أن يؤدي إلى تحسين النتيجة.

​ <br /><br />
     طرق العلاج

​<br /><br />
     يتم استخدام طرق العلاج التالية على نطاق واسع لفشل التلقيح الاصطناعي المتكرر بناءً على تقييمك من قبل الطبيب المعالج:
      `,
      fourList: [
        'خدش بطانة الرحم',
        'مجموعة تقبل بطانة الرحم (ERA)',
        'بريدنيزولون',
        'العلاج داخل الشحميات',
        'تجميد جميع أجنة اليوم الخامس في دورة جديدة واستبدالها في دورة غير محفزة',
        'الإدارة السليمة للعامل الذكوري من قبل طبيب أمراض الذكورة لتحسين جودة الحيوانات المنوية قبل محاولة دورة التلقيح الصناعي',
      ],
    },
  };

  const [activeTab, setActiveTab] = useState<string>(tabs[0]);
  const currentContent = tabContents[activeTab];

  return (
    <div className="ptb-140">
      <div className="container tabs-container">
        {/* Tabs buttons */}
        <div className="tabs-row-container mb-4 d-flex flex-wrap justify-content-center gap-2">
          {tabs.map((tab) => (
            <button
              key={tab}
              className={`tabs-btn ${activeTab === tab ? 'active' : ''}`}
              onClick={() => {
                setActiveTab(tab);
                const hash = tabToHash(tab);
                history.replaceState(null, '', `#${hash}`);
              }}
            >
              {tab}
            </button>
          ))}
        </div>
        <style jsx>{`
          @media (max-width: 768px) {
            .tabs-row-container {
              flex-wrap: nowrap !important; /* ek line me rakhe */
              overflow-x: auto; /* scroll allow kare */
              justify-content: flex-start !important; /* scroll start se */
              -webkit-overflow-scrolling: touch; /* smooth scroll on iOS */
            }

            .tabs-row-container .tabs-btn {
              flex: 0 0 auto; /* button shrink na ho */
              margin-right: 10px; /* buttons ke beech gap */
            }
            .image-col {
              order: -1; /* image ko top pe le aao */
              width: 100%; /* full width */
              margin-bottom: 15px;
            }
            .tabs-container {
              border: 1px solid #0000003d;
              padding: 10px 10px !important;
              margin: 0px 10px 0px 0px;
              width: 355px;
            }
            .visit-text {
              font-size: 12px;
            }
          }
        `}</style>
        {/* Tabs Content */}
        <div className="row justify-content-center align-items-center g-4">
          <div className="col-lg-8 col-md-6">
            <div
              className="left mx-lg-5 visit-text"
              dangerouslySetInnerHTML={{ __html: currentContent.text }}
            />
          </div>

          <div className="col-lg-4 col-md-6 image-col">
            <OptimizedImage
              imageName={currentContent.imageName}
              alt={activeTab}
              className="img-fluid fertilitytabs-image"
            />
          </div>
        </div>

        {/* Bottom text + lists */}
        <div className="row mt-3">
          <div className="col-lg-11 mx-lg-5 visit-text">
            <div dangerouslySetInnerHTML={{ __html: currentContent.bottomText }} />

            <CustomList items={currentContent.bottomTextList} />

            {currentContent.extraText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.extraText }}
              />
            )}

            <CustomList items={currentContent.secondlist} />

            {currentContent.secondText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.secondText }}
              />
            )}

            <CustomList items={currentContent.extraList} />
            {currentContent.thirdText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.thirdText }}
              />
            )}
            <CustomList items={currentContent.thirdList} />
            {currentContent.fourText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.fourText }} />
            )}
            <CustomList items={currentContent.fourList} />
            {currentContent.fiveText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.fiveText }} />
            )}
            <CustomList items={currentContent.fiveList} />
            {currentContent.sixText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.sixText }} />
            )}
            <CustomList items={currentContent.sixList} />
            {currentContent.sevenText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.sevenText }}
              />
            )}
            <CustomList items={currentContent.sevenList} />
            {currentContent.eightText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.eightText }}
              />
            )}
            <CustomList items={currentContent.eightList} />
            {currentContent.nineText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.nineText }} />
            )}
            <CustomList items={currentContent.nineList} />
          </div>
        </div>
      </div>
    </div>
  );
};

export default FertilityTabs;
