"use client";

import React from "react";
import Image from "next/image";

const AboutusSection = () => {
  const values = [
    "Patient-Centered Care",
    "Innovation & Research",
    "Collaboration & Teamwork",
    "Integrity & Transparency",
    "Excellence in Service",
  ];

  return (
    <div className="fertility-area mt-5">
      <div className="container">
        <div className="section-title">
          <div className="row justify-content-center align-items-center g-4">
            <div className="col-lg-12 col-md-12">
              <div className="left">
                <h2>نسب النجاح</h2>

              </div>

            </div>
            <div className="left">

              <p>
                في "بنون"، نؤمن أن لكل شخص الحق في تجربة الأبوة أو الأمومة. ورغم أن نسب النجاح قد تختلف من حالة لأخرى بحسب العمر والحالة الطبية، فإن التزامنا لا يتغيّر: كل زوجين يستحقون الفرصة<br /><br />
                نضع في صميم عملنا مبدأ الشمولية والتعاطف، ونسعى إلى تقديم رعاية خصوبة تقوم على الإمكانيات لا الاحتمالات۔ <br /><br />


                منذ انطلاقتنا عام 2013، نجري أكثر من 5,000  دورة أطفال أنابيب سنوياً، وقد ساعدنا عشرات الآلاف من الأزواج في تحقيق حلمهم. واليوم، نفتخر بتحقيق معدلات نجاح تُضاهي أفضل المراكز عالمياً، وذلك عبر مجموعة متكاملة من العلاجات المتقدمة، تشمل عمليات أطفال الأنابيب والتلقيح الاصطناعي والحقن المجهري، والتخصيب الاصطناعي المصغر، والتخصيب (CCS) داخل الرحم بالدورة الطبيعية، والتلقيح داخل الرحم، واختيار جنس الجنين، وعلاجات العقم عند الذكور، والفحص الشامل للكروموسومات<br /><br />


                نستخدم أحدث التقنيات المدعومة بالذكاء الاصطناعي، ويقود هذا العمل فريق من الاستشاريين والخبراء حاملي شهادات عالمية وتلقوا تدريبهم في أفضل الجامعات والمستشفيات العالمية ممن يضعون الخطط العلاجية بناءً على أدلة علمية، وبأسلوب شخصي يناسب كل حالة۔<br /><br />
                نحن هنا لنسير معكم خطوة بخطوة — لأننا في "بنون" نؤمن أن رحلتكم تستحق كل اهتمام۔
              </p>

            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default AboutusSection;
