'use client';

import React, { useState } from 'react';
import OptimizedImage from '@/components/ui/OptimizedImage';
import CustomList from '@/components/Common/CustomList';
const tabToHash = (tab: string) =>
  tab
    .toLowerCase()
    .replace(/\//g, '') // slash remove
    .replace(/\s+/g, '-'); // spaces → dash

interface TabContent {
  text: string;
  imageName: string;
  bottomText: string;
  bottomTextList?: string[];
  secondlist?: string[];
  secondText?: string;
  extraList?: string[];
  extraText?: string;
  thirdText?: string;
  thirdList?: string[];
  fourText?: string;
  fiveText?: string;
  sixText?: string;
  fourList?: string[];
  fiveList?: string[];
  sixList?: string[];
  sevenText?: string;
  eightText?: string;
  nineText?: string;
  sevenList?: string[];
  eightList?: string[];
  nineList?: string[];
}

const VisitTabs: React.FC = () => {
  const tabs = [
    'الزيارة الأولى',
    'أطعمة تزيد الخصوبة',
    'مراقبة التلقيح الاصطناعي',
    'جمع البيض',
    'نقل/استبدال الأجنة',
  ];

  const tabContents: Record<string, TabContent> = {
    'الزيارة الأولى': {
      text: `
       قد تشعرين بالعجز واليأس عندما لا يأتي الحمل بسهولة. قد تشعر بالوحدة، وكأن لا أحد يفهم ما تمر به. 15% من المتزوجين يعانون من تأخر الحمل. هذا يعني أنك لست وحدك وتأكد أن وضعك ليس ميؤوسًا منه.<br /><br />
       هل تتساءلين عما يجب أن تأخذيه معك في موعدك الأول مع عيادة الخصوبة؟ إليك الأشياء التي لا تريد أن تتركها خلفك:<br /><br />
      شريككr<br /><br />
     قائمة بالأسئلة التي يمكنك طرحها على طبيب الخصوبة الخاص بك (لا تخف من التحدث والدفاع عن نفسك!). يرجى الانتباه إلى وقتك أثناء الزيارة ولا تضيع الوقت بتذكر ومعاناة الماضي. استفد من وقتك الحالي حيث نهتم بك جميعًا.

​

​ `,
      imageName: 'visit-first-clinic',
      bottomText: `
        <strong>المستندات بما في ذلك تاريخك الطبي</strong><br />​

المستندات التي تتضمن تاريخك الطبي، وملخصات الخروج من المستشفى، ونتائج الاختبارات المعملية، ونتائج فحوصات التصوير الطبي (مثل الموجات فوق الصوتية)، والتقارير الطبية مع نتائج الاختبارات المرفقة التي تؤكد التشخيص والعلاج، ومعلومات حول العمليات الجراحية والتدخلات السابقة (بما في ذلك التلقيح وبرامج التلقيح الصناعي) و وثائق أخرى توفر الأساس للتحقق من حالتك الطبية من قبل الأطباء السابقين.<br /><br />
        سيكون هذا مفيدًا لتوفير وقتك وبدء العلاج في أقرب وقت ممكن.<br />
       عندما يتعلق الأمر بالعقم، فإن الوقت ليس في صفك دائمًا. كلما أسرعت في طلب المساعدة وبدء العلاج، زادت فرص نجاحك.<br /><br />
      في موعدك الأول للخصوبة، سيطرح عليك طبيبك العديد من الأسئلة لإجراء تشخيص دقيق. كن مستعدًا لمشاركة التفاصيل حول ما يلي:<br /><br />
        حالات الحمل والولادة والإجهاض السابقة

​
      `,
      secondlist: [
        ' أنماط التبويض والدورة الشهرية',
        ' الأعراض الحالية والسابقة والأدوية والعمليات الجراحية والأمراض والإصابات',
        'التعرض للسموم البيئية أو ضغوطات الحياة الرئيسية',
        ' أي تاريخ عائلي للعقم أو مشاكل الصحة الإنجابية',
        'بعض الأمراض مثل الأمراض المنقولة جنسيًا (STDs)، ومرض التهاب الحوض (PID)، وغيرها',
        ' العيوب الخلقية والعمليات الجراحية السابقة',
        'الأنسجة الندبية أو الأورام الليفية أو الأورام الحميدة في الرحم',
        'العجز الجنسي عند الذكور',
      ],
      secondText: `​

إذا كان لديك أي مشاكل صحية أخرى، كوني مبادرة ومستعدة لمناقشتها مع طبيب الخصوبة الخاص بك.<br />
      بعد موعدك الأول، قد تحتاجين إلى العودة لإجراء المزيد من اختبارات الخصوبة.
      <br /><br />
     قد تشمل اختبارات الخصوبة الاختبارات الهرمونية والموجات فوق الصوتية وتصوير الرحم وتحليل السائل المنوي واختبارات إضافية أخرى قد تكون مطلوبة بناءً على حالتك.<br /><br />
     بعد مراجعة شاملة، سيقوم طبيبك بوضع خطة علاج الخصوبة المناسبة لك تمامًا. هدفنا هو زيادة فرصتك في الحمل وإنجاب طفل سليم.<br /><br />
     ​بعد الزيارة الأولى، قم بمتابعة التعليمات المقدمة لك ويجب إكمال أي طلب اختبارات خصوبة قبل الزيارة التالية. سيتم إرسال نتائج اختبارات الخصوبة بينك وبين المركز من خلال منسقينا لمناقشتها مع طبيبك في زيارتك القادمة للعيادة.
      `,
    },

    'أطعمة تزيد الخصوبة': {
      text: `
       يلجأ الأزواج من جميع أنحاء المملكة العربية السعودية ومنطقة الخليج إلى مركز بنون للحصول على علاج ورعاية متميزة ومخصصة للتخصيب في المختبر (IVF). إن معدلات نجاحنا الاستثنائية وفريقنا ذو الخبرة من الاستشاريين المتفانين يجعلنا أحد أفضل مراكز الخصوبة في منطقة الخليج.<br /><br />
       نحن نحرص على التأكد من أن كل مريض لدينا يشعر بالرعاية الجيدة والدعم خلال رحلتهم لتنمية أسرهم. يمكن أن يكون علاج العقم المقترن بالسفر والمسافة أمرًا متعبًا، لذلك من المهم بشكل خاص أن نبذل كل ما في وسعنا لتسهيل الرحلة على مرضانا الذين يسافرون لمسافات طويلة.
      `,
      imageName: 'visit-out-of-town',
      bottomText: `يقع مركزنا في منطقة ممتازة بمدينة الرياض وعلى مسافة قريبة سيرًا على الأقدام من "مركز غرناطة"، أحد أكبر مراكز التسوق في المدينة، وفندق هيلتون الرياض حيث تقع محطة المترو. موقعنا قريب من المطار مما يجعل الوصول من وإلى المطار عبر المترو أو السيارة سهلاً وبعيدًا عن حركة المرور الكثيفة. حتى بالنسبة للمسافرين بالسيارة من خارج الرياض، فإن التقاطع الشهير بين الدائري الشمالي والدائري الشرقي وطريق الدمام السريع يجعل من السهل الوصول إلى بنون عن طريق تجنب ازدحام وسط المدينة.<br /><br />
     حظى الأزواج المقيمون خارج الرياض باهتمام خاص فيما يتعلق باختبارات الخصوبة وزيارات المتابعة. يمكن إجراء بعض الاختبارات في منطقة إقامتك المحلية حسب الضرورة. ومع ذلك، فإن بدء علاج الخصوبة يتطلب مراقبة دقيقة وسيتم توجيه المواعيد المخططة للزيارات إليك. ليس مطلوبًا منك البقاء في الرياض أثناء رحلة علاجك إلا إذا طلب منك طبيبك ذلك.

​<br /><br />
     إن التزامك بالمتابعة يعطي النتائج والنتيجة المتوقعة لعلاج الخصوبة. قد يؤثر فقدان المتابعة أو تأخيرها أثناء العلاج على نتيجة العلاج.<br />
    ​

​إذا واجهت أي مشكلة أثناء المتابعة، بسبب فقدان الرحلة أو طول الطريق إلى الرياض، يرجى توجيهها إلى طبيبك أو منسق العلاج عبر الاتصال الهاتفي على الأرقام المعطاة لك لإرشادك إلى ما يجب عليك فعله بعد ذلك.
      `,
    },

    'مراقبة التلقيح الاصطناعي': {
      text: `
       في اليوم الأول من الدورة الشهرية (التدفق الطبيعي) عليك الاتصال بمركز بنون الطبي (4448080-011) لتحديد موعد في اليوم 2-3 من الدورة الشهرية لإجراء فحص الموجات فوق الصوتية وعمل الدم اللازم. في نفس يوم الفحص بالموجات فوق الصوتية، سيقوم طبيبك بمراجعة حالتك، وبناءً على النتائج، ستبدأين في تحفيز المبيض باستخدام حقن الغدد التناسلية يوميًا بدءًا من اليوم 2-3 وقد يستمر لمدة 8-12 يومًا اعتمادًا على استجابة المبيض.<br /><br />
       سيتم تحديد الجرعة اليومية من الأدوية من قبل طبيبك بما يتناسب مع حالتك. يجب أن تتم مراقبتك خلال هذه الفترة لمدة 3-4 مرات حسب الحاجة. مثال على الأدوية:
      `,
      imageName: 'visit-ivf-monitoring',
      bottomText: ``,
      secondlist: [
        'قلم جونال إف: يعطى تحت الجلد. يأتي Gonal F في قلم متعدد الجرعات (300 – 450 – 900 – 1200 وحدة دولية).',
        'مينوبور: يعطى تحت الجلد. Menopur يأتي في أمبولة (75 – 600 – 1200 وحدة دولية).',
        'ميريونال: يعطى عضلياً أو تحت الجلد. Merional يأتي في أمبولة (75 - 150 وحدة دولية).',
        'مينوغون: يعطى عضلياً أو تحت الجلد. Merional يأتي في أمبولة (75 وحدة دولية).',
      ],
      secondText: `
       
سيتم إضافة أدوية إضافية على سبيل المثال "Cetrotide 0.25 mg" أثناء عملية تحفيز المبيض من أجل التحكم في الدورة. يجب تناول هذه الأدوية في الموعد الذي يحدده الطبيب، وعادةً ما يتم البدء بها بعد 4 أيام من تحفيز المبيض.<br /><br />
        ​

يرجى تناول جميع هذه الأدوية في نفس الوقت. ويفضل أن تقترح وقتًا بين وقت الظهر وحتى غروب الشمس ولكن ليس في وقت مبكر جدًا من الصباح أو في وقت متأخر جدًا من المساء.<br /><br />
       يتم حقن بعض الأدوية ذاتيًا تحت جلد البطن أو الفخذين وسيقوم طاقم التمريض لدينا بتعليمك كيفية القيام بذلك بنفسك أو بزوجك. يتم إعطاء بعض الأدوية الأخرى على شكل حقن عضلية؛ ولذلك، يجب على الممرضة إعطاء الحقنة. سوف تتلقى تعليمات مكتوبة مفصلة لكل دواء على حدة..<br /><br />
       بمجرد تطوير عدد معقول من البصيلات الناضجة، سيتم إعطاؤك حقنة HCG لتعزيز نضج البويضة النهائي. بعد حوالي 36 ساعة من حقن HCG، سيتم تحديد موعد لإجراء عملية جمع البويضات. تعتبر هذه الحقنة حيوية وضرورية لجمع البويضات ويجب أخذها في التاريخ والوقت الصحيحين.<br /><br />
        ​

يجب على زوجك الامتناع عن ممارسة الجنس قبل 2-4 أيام من يوم جمع البويضات.<br />
       ​يرجى العلم أن الهدف من المراقبة الدقيقة هو التحكم في دورة العلاج وإنتاج بويضات ناضجة. في حالة الاستجابة الزائدة أو المنخفضة، قد يقوم طبيبك بإلغاء الدورة وتعديل خطة العلاج للدورة المستقبلية.
      `,
    },
    'جمع البيض': {
      text: `
      <strong>قبل جمع البيض:</strong><br /><br />
      سوف تحتاج إلى ملء نماذج مختلفة بما في ذلك علاج التلقيح الصناعي والموافقات الجراحية. يرجى التأكد من قيامكما، كزوجين، بقراءة جميع النماذج والتوقيع عليها قبل يوم جمع البويضات. قد تنتهي نماذج الموافقة غير المكتملة بإلغاء علاجك.<br />
      يرجى سؤال طبيبك إذا لم تكن متأكدًا من الأدوية التي يجب عليك الاستمرار في تناولها.

سيُطلب منك الامتناع عن الأكل والشرب اعتبارًا من منتصف الليل في الليلة السابقة ليوم جمع البيض.​
      `,
      imageName: 'visit-egg-collection',
      bottomText: `<strong>يوم جمع البيض:</strong><br /><br />
      ​

سيُطلب منك الوصول الساعة 07:30 صباحًا قبل إجراء العملية لمقابلة ممرضة ما قبل العملية وطبيب التخدير الخاص بك. من المهم جدًا أن تأتي في الوقت المناسب لضمان عدم تأخير قضيتك. يجب عليك الاتصال بمركزنا على الفور إذا تأخرت.<br />
      من فضلك لا تنسى إحضار بطاقات الهوية الأصلية الصالحة معك وتقديمها لموظفينا عند الوصول.<br />
     للسعوديين: بطاقة الهوية الوطنية للزوج والزوجة + بطاقة العائلة.<br />
     لغير السعوديين: بطاقة الإقامة للزوج والزوجة + شهادة الزواج<br />
      يرجى عدم استخدام المستحضر أو ​​المكياج أو العطور أو المجوهرات.<br />
     سوف تحتاجين إلى شخص ما ليقودك إلى المنزل من المركز بعد جمع البويضات بسبب التخدير الوريدي، يرجى تجنب وسائل النقل العام. نوصي بأن يبقى شخص بالغ مسؤول أو مقدم رعاية معك في المنزل لبقية اليوم التالي لجمع البويضات.

​<br /><br />
     بعد جمع البويضات، من الشائع الشعور بالنعاس وربما الشعور بألم خفيف وغثيان ودوخة طفيفة. من المهم عدم جدولة أي نشاط تجاري أو اجتماعي مباشرة بعد إجراء العملية لتمنح نفسك وقتًا للراحة تمامًا في ذلك اليوم. يميل معظم المرضى إلى الشعور بالراحة في اليوم التالي لإجراء العملية ويكونون قادرين على العودة إلى العمل.<br /><br />
     ​

ضعي في اعتبارك أن المبيضين غالبًا ما يتضخمان وقد يكون الجماع غير مريح إلى حد ما. لذلك ننصحك بتجنب الاتصال الجنسي بعد العملية حتى بعد نقل الأجنة لتقليل احتمالية الألم. وإلا فلا ضرر من الجماع بعد تلك الفترة<br /><br />
     من الطبيعي أن يكون هناك نزيف مهبلي خفيف بعد جمع البويضات. وغالبًا ما يأتي من جدار المهبل "منطقة اختراق الإبرة". عادة، يستمر لمدة 3 أيام، ولكن إذا شعرت أن النزيف أقوى من الدورة الشهرية وقمت بتغيير الفوطة بشكل متكرر، كل أقل من 30 دقيقة، خلال الساعات الأربع التالية بعد الإجراء، فيجب عليك الاتصال بطبيبك أو العلاج منسق في المركز .<br />
     يتم إجراء جمع البيض لمدة يوم واحد ويوصى بالبقاء في المدينة طوال الليل للتأكد من أن كل شيء يسير على ما يرام معك. يمكنك السفر خارج المدينة في اليوم التالي إذا كنت بخير.

​<br /><br />
     في نفس يوم جمع البويضات عليك اتباع تعليمات البدء بتناول هرمون البروجسترون المهبلي والفموي ليلاً، ثم مرتين من اليوم التالي حتى يوم نقل الأجنة وخلال يوم اختبار الحمل، حسب بروتوكول بنون.

​<br /><br />
     ​

يجب أن يبدأ أي علاج مساعد إضافي يصفه طبيبك في نفس يوم جمع البويضات ليلاً. على سبيل المثال: المضادات الحيوية، والأسبرين، والكليكسان، والبروجستيرون القابل للحقن، وما إلى ذلك.<br /><br />
     بعض هذه الأدوية مخصصة لفترة قصيرة والبعض الآخر لفترة أطول، لذا تناولها وفقًا لتعليمات فريقنا بالضبط.<br />
     ​في اليوم التالي بعد جمع البويضات، سيتم الاتصال بك من قبل منسق العلاج لدينا للاطمئنان عليك والتأكد من أن كل شيء على ما يرام وسيتم إبلاغك ببويضاتك ونتائج الإخصاب وكذلك اليوم المتوقع لنقل الأجنة. إذا ظهرت أي معلومات جديدة خلال هذه الفترة حتى يوم نقل الأجنة، فسيتم الاتصال بك وإبلاغك بذلك.
      `,
    },
    'نقل/استبدال الأجنة': {
      text: `
     سيتم نقل الأجنة بعد 3-5 أيام من جمع البويضات. وهو إجراء بسيط حيث يتم تحميل قسطرة ناعمة بالأجنة الأفضل تكوينًا ومن ثم إدخالها داخل تجويف الرحم لوضع الأجنة. سيتم إجراء عملية زرع الأجنة خلال الأيام القليلة القادمة وسيظهر اختبار الحمل بعد 14 يومًا من يوم نقل الأجنة.

<br /><br />
      <strong>​

قبل تنفيذ الإجراء</strong><br /><br />
    سيُطلب منك امتلاء المثانة قبل إجراء العملية لتسهيل إدخال القسطرة الناعمة إلى الرحم. لا تحتاج إلى أن تكون صائما.
      `,
      imageName: 'visit-embryo-transfer',
      bottomText: `بعد نقل الأجنة، ستبقى لمدة 30 دقيقة في غرفة الإنعاش، ومع ذلك، يمكنك الذهاب إلى المرحاض في أي وقت إذا كنت بحاجة لذلك. يمكنك العودة إلى المنزل في ذلك اليوم ولا يُحظر عليك ممارسة نشاطك الطبيعي ولكن تجنب المجهود مثل؛ ممارسة التمارين الرياضية الثقيلة، أو رفع أو دفع الأشياء الثقيلة.<br />
      يمكنك تجنب الجماع لمدة 2-3 أيام من هذا اليوم ولكن ليس هناك أي ضرر بعد تلك الفترة.<br /><br />
      يمكنك السفر بالسيارة أو الطائرة في اليوم التالي، إذا كنت بحاجة لذلك، حيث لا يوجد دليل على أن ذلك سيكون ضارًا. إذا كنت تعملين، يمكنك استئناف عملك من اليوم التالي بعد نقل الأجنة.<br /><br />
     ​

يُطلب منك الاستمرار على نفس الدواء الذي كنت تتناوله قبل نقل الأجنة ووفقًا لتعليمات الطبيب المعالج. من الطبيعي أن يكون هناك إفرازات مهبلية بنية اللون بسبب هرمون البروجسترون المستخدم لدعم الجسم الأصفر.<br /><br />
     لا تعتبر هذه الإفرازات المهبلية البنية نزيفًا ولا تحتاجين إلى فعل أي شيء حيال ذلك.<br /><br />
      في حالة ظهور بقع حمراء زاهية أو نزيف أحمر من المهبل، يجب عليك الاتصال بالمركز واستشارة طبيبك للحصول على مزيد من التعليمات.<br />
     عادةً، سيتم إرشادك إما بزيادة جرعة البروجسترون التي تستخدمها بالفعل أو إضافة شكل آخر من البروجسترون إلى الجرعة الحالية.<br /><br />
      يرجى اتباع تعليمات طبيبك لأن كل حالة فريدة من نوعها.<br /><br />
      إذا كان اختبار الحمل الكمي إيجابيًا، فأنت بحاجة إلى تكراره، على الأقل، بعد 48 ساعة للتأكد من تقدمه بشكل طبيعي. إذا كان كل شيء على ما يرام، استمر في تناول الأدوية حتى ترى طبيبك.<br /><br />
      سيتم تحديد موعد لك بعد 2-3 أسابيع لإجراء الموجات فوق الصوتية للحمل للتأكد من موقع الحمل وقدرته على البقاء.<br /><br />
     نحن ندرك أن فترة الانتظار لمدة أسبوعين قبل إجراء اختبار الحمل تعتبر مرهقة لكلا الزوجين. ومع ذلك، فإن الحفاظ على الإخلاص والتفاؤل والعودة إلى أنشطتك المعتادة وتجنب الحياة طريحة الفراش يساعد كثيرًا في تقليل التوتر ويعزز ثقتك بنفسك.
`,
    },
  };

  const [activeTab, setActiveTab] = useState<string>(tabs[0]);
  const currentContent = tabContents[activeTab];

  return (
    <div className="ptb-140">
      <div className="fertility-area">
        <div className="container">
          <div className="section-title">
            <div className="row justify-content-center align-items-center g-4">
              <div className="col-lg-12 col-md-12">
                <div className="left mb-3">
                  <h2>​ رحلتكم نحو الأبوة والأمومة مع "بنون"</h2>
                </div>
              </div>
            </div>
            <p>
              {' '}
              في "بنون"، نحرص على أن تكون تجربتكم معنا مريحة، مُطمئنة، ومليئة بالدعم في كل خطوة.
              سواء كانت هذه زيارتكم الأولى أو موعد متابعة، فإن فريقنا المتخصص موجود دائماً ليقدّم 
              لكم الإرشاد والمساندة — من لحظة فهم الخيارات العلاجية المتاحة وحتى ضمان تجربة سلسة
              داخل مراكزنا۔
            </p>
            <p>
              هذه الصفحة صُمّمت لتزويدكم بكل ما تحتاجون معرفته قبل زيارتكم، لتشعروا بالثقة،
              والاطمئنان، والاستعداد الكامل لبدء أو مواصلة رحلتكم معنا.{' '}
            </p>
          </div>
        </div>
      </div>
      <div className="container tabs-container">
        {/* Tabs buttons */}
        <div className="tabs-row-container mb-4 d-flex flex-wrap justify-content-center gap-2">
          {tabs.map((tab) => (
            <button
              key={tab}
              className={`tabs-btn ${activeTab === tab ? 'active' : ''}`}
              onClick={() => {
                setActiveTab(tab);
                const hash = tabToHash(tab);
                history.replaceState(null, '', `#${hash}`);
              }}
            >
              {tab}
            </button>
          ))}
        </div>
        <style jsx>{`
          @media (max-width: 768px) {
            .tabs-row-container {
              flex-wrap: nowrap !important; /* ek line me rakhe */
              overflow-x: auto; /* scroll allow kare */
              justify-content: flex-start !important; /* scroll start se */
              -webkit-overflow-scrolling: touch; /* smooth scroll on iOS */
            }

            .tabs-row-container .tabs-btn {
              flex: 0 0 auto; /* button shrink na ho */
              margin-right: 10px; /* buttons ke beech gap */
              font-size: 14px;
            }
            .image-col {
              order: -1; /* image ko top pe le aao */
              width: 100%; /* full width */
              margin-bottom: 15px;
            }
            .tabs-container {
              border: 1px solid #0000003d;
              padding: 10px 10px !important;
              margin: 0px 10px 0px 0px;
              width: 355px;
            }
            .visit-text {
              font-size: 12px;
            }
          }
        `}</style>
        {/* Tabs Content */}
        <div className="row justify-content-center align-items-center g-4">
          <div className="col-lg-8 col-md-6">
            <div
              className="left mx-lg-5 visit-text"
              dangerouslySetInnerHTML={{ __html: currentContent.text }}
            />
          </div>

          <div className="col-lg-4 col-md-6 image-col">
            {tabs.map((tab) => (
              <div key={tab} style={{ display: activeTab === tab ? '' : 'none' }}>
                <OptimizedImage
                  imageName={tabContents[tab].imageName}
                  alt={tab}
                  className="img-fluid fertilitytabs-image"
                  sizes="100vw"
                  style={{ width: '100%', height: 'auto' }}
                />
              </div>
            ))}
          </div>
        </div>

        {/* Bottom text + lists */}
        <div className="row mt-3">
          <div className="col-lg-11 mx-lg-5 visit-text">
            <div dangerouslySetInnerHTML={{ __html: currentContent.bottomText }} />

            <CustomList items={currentContent.bottomTextList} />

            {currentContent.extraText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.extraText }}
              />
            )}

            <CustomList items={currentContent.secondlist} />

            {currentContent.secondText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.secondText }}
              />
            )}

            <CustomList items={currentContent.extraList} />
            {currentContent.thirdText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.thirdText }}
              />
            )}
            <CustomList items={currentContent.thirdList} />
            {currentContent.fourText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.fourText }} />
            )}
            <CustomList items={currentContent.fourList} />
            {currentContent.fiveText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.fiveText }} />
            )}
            <CustomList items={currentContent.fiveList} />
            {currentContent.sixText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.sixText }} />
            )}
            <CustomList items={currentContent.sixList} />
            {currentContent.sevenText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.sevenText }}
              />
            )}
            <CustomList items={currentContent.sevenList} />
            {currentContent.eightText && (
              <div
                className="mt-3"
                dangerouslySetInnerHTML={{ __html: currentContent.eightText }}
              />
            )}
            <CustomList items={currentContent.eightList} />
            {currentContent.nineText && (
              <div className="mt-3" dangerouslySetInnerHTML={{ __html: currentContent.nineText }} />
            )}
            <CustomList items={currentContent.nineList} />
          </div>
        </div>
      </div>
    </div>
  );
};

export default VisitTabs;
